using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Xml;

namespace GraphBook1._0
{
    public class StoryInformation
    {
        public string RootStoty()
        {
            Console.WriteLine("Принц Артър седеше на престола във величествения замък на Асгард, гледайки през високите прозорци, чиято красота се конкурираше само с неговата собствена младост. " +
                              "Но под красивата външност на този свят се криеше мрак.\r\n\r\nНа деня, когато навърши десет години, баща му - Императорът на Асгард, се отправи на тайнствена мисия в Тъмната гора. " +
                              "Тъмната гора беше мястото, където заплахата от чичото на Артър, зъл магьосник на име Гаргамел, вирееше.\r\n\r\nМисията имаше фатален край за Императора. " +
                              "Отровата на магията на самия му брат го погълна, оставяйки Артър на трона с тежко сърце и жажда за отмъщение.\r\n\r\nГодини по-късно, в сърцето на нощта, в замъка на Артър пристига странник. " +
                              "Този тайнствен човек твърди, че баща му не е мъртъв, а че е в плен на Гаргамел. " +
                              "Решението на Артър - дали да повярва на странника и да започне опасното пътешествие към Тъмната гора, или да отхвърли тази надежда, " +
                              "като приеме, че баща му е загубен завинаги - зависи от ТЕБ.");
           Console.WriteLine("1-повярва\n2-отхвърли");

            return "Това е началото на твоето приключение.";
        }
        public string FirstChoice()
        {
            Console.WriteLine("С решението да повярва в странника, Артър събира своите най-добри войници и започва своето пътешествие към Тъмната гора." +
                              " Пътят е изпълнен с трудности и избори, които ще определят съдбата на принца и неговите спътници.");

            return "Това е изборът на Артър ако избере да повярва";
        }
        public string MessWithSpiders()
        {
            Console.WriteLine("След като преминават отвъд стените на империята, отрядът се озовава в тъмната и трънлива гора." +
                              " Гигантски паяци, изплитащи тъмни мрежи, преследват Артър и неговите хора. Сега ти трябва да избереш:\n1-Пробиваме напред \n2 - Търсим обходен път");

            return "Срещата с паяците";
        }
        public string BattleWithSpider()
        {
            Console.WriteLine(" Артър решава да се изправи срещу гигантските паяци. " +
                              "Вземайки решението \"Пробиваме  напред!\", принцът и неговият отряд се оказват в средата на опасна и напрегната битка." +
                              "От теб зависи какво да правят дали да (1) останат и да се бият храбро (2) или тактически да избягат :)");

            return "Битката с паяците";
        }

        public string BattleContinues()
        {
            Console.WriteLine("След като Артър подаде знак за атака, атмосферата в гората стана напрегната. " +
                              "Остриетата на войниците светнаха в тъмнината, а стрелите фучаха безмилостно към паяците . Битката продължи дълго " +
                              ", но за съжаление паяците взеха надмощие и сложиха край на всички воини , включително и на Артър.");
            Console.ForegroundColor = ConsoleColor.Red;
            Console.WriteLine("Край!");
            Console.ForegroundColor = ConsoleColor.White;

            return "Фаталния край срещу паяците";
        }

        public string MysteriousTemple()
        {
            Console.WriteLine("След умелото оттегляне, отрядът открива старинен храм, скрит в дълбините на гората. В храма се крие древно предсказание, което обещава път на успех," +
                              " но и предупреждава за изпитания пред тези, които смело вървят напред.1-Изследване на храма\n 2- Бързане напред, игнорирайки предупрежденията");

            return "Старинен храм";
        }
        public string FastMoving()
        {
            Console.WriteLine("Младите воини решават , че не искат да губят време , защото по петите им се задава гръмотевична буря.Те се качват на конете и бързо започват да препускат по стръмноте пътища. В малките часове на нищта" +
                "те забелязват село.");
            Console.WriteLine("1-Отиват в селото\n2- правят си бивак");
            return "Решават че не искат да губят време и продължават напред";


        }
        public string ExploreTemple()
        {
            Console.WriteLine("Артър и храбрите воини решават да изследват храма в дълбочина, без да обръщат внимание на предупрежденията. " +
                              "Сред великолепната архитектура се откриват множество стаи и пътища.Продължавайки напред, отрядът се изправя пред стая със скрити капани и предизвикателства. " +
                              "Стъпването в определени сектори на пода предизвиква активиране на механизми, изстрелване на отровни стрели от стените, падане на камъни от тавана. " +
                              "Артър и неговите спътници трябва да бъдат внимателни, за да избегнат опасността." +
                              "Без да иска най-невнимателния от тях стъпва на погрешна плочка и се активират всички капани. С невероятна ловкост Артър и компания почти успяват да ги избегнат . След дълго бягане в тесните тунели на храма те най- после се измъкват." +
                              "За нещастие Артър е тежко ранен и има нужда от помощ. Сега са пред дилема дали да продължат напред или да потърсят помощ. 1-търсене на помощ \n 2 - продължаван напред ");
            return "Изследване на храма";
        }

        public string MovingForward()
        {
            Console.WriteLine("Независимо от раните си, Артър и войниците решават да продължат напред. Те са готови да поемат нови рискове и изпитания, за да достигнат до крайната цел - отмъщение и победа. " +
                              "Въпреки тежките рани, Артър показва решителност и смелост.След 5 дни преход и страшни бури в края на силите си Артър и отряда му виждат село.1- отидат в селото\n 2- да направят бивак до селото");

            return "";
        }

        public string SeekingHelp()

        {
            Console.WriteLine("Правят си бивак , и Артър като капитан на отряда изпраща най- верният си войн в търсена на помощ.Обаче той не се завръща и отрядът му е застигнат от опасна буря." +
                              "Заради гръмотевиците конете се разбягват и младите и храбри воини са в безизходица.Не след дълго заради студените нощи Артър загива заради загуба на кръв и премръзване.Без водач отрядът също намира фаталния си край.");
            Console.ForegroundColor = ConsoleColor.Red;
            Console.WriteLine("Край!");
            Console.ForegroundColor = ConsoleColor.White;

            return "";
        }
        public string Village()
        {
            Console.WriteLine("Вътре в селото, Артър и отрядът се срещат с местните жители. Хората ги гледат с любопитство и страх. " +
                              "Един старец се приближава към тях, готов да им помогне. Той разказва за страховете в тъмната гора и как да се справят с тях." +
                              "Също така там Артър намира лек за раните си и готов с нови сили , заедно с наличната информация младите воини най сетне отиват до тъмната гора в изследване на терена те намират и царството на Гаргамел." +
                              "Артър и воините забелязват колко много тъмни и магични същества бродят и гората и сега дилема е.1- дали да се бият и да минат като рамбо \n2-Или внимателно и скрито да се промъкнат в замъка");
            return "";
        }

        public string FightWithDemons()
        {
            Console.WriteLine("Битката започва. Тъмната гора се разтресе все едно хиляда гръмотевици удариха земята.Из трънливите храсти и изсъхнали дървета се появиха всякакви демони и чудовища, койот до сега в никоя приказка не е имало." +
                "Храбрите воини смело крачат напред към портите на кралството и секат главите на чудовищата наред. Кръв се лее като реки. Някой от воините загинаха храбро, но Артър успява да влезе в замъка на Чичо си . Качва се на най високата кула , където го очаква и злизат Гаргамел." +
                "Гаргамел му подава сандък.Артър отваря сандъка и вътре какво да види.Главата на баща му.Със насълзени очи , потни длани, кръв по лицето Артър взема меча си , насочва го към чичо си и му показва че иска да му отмъсти.Битката започва. Злият Гаргамел почва да обстрелва " +
                "племенника си със зли магии и заклинания, обаче чистото му сърце и душа не позволяват да го покорят.Но Гаргамел поваля Артър и преди да го довърши той му казва му прошепва/С теб ще е свършено/И с неописуема гняв Артър се изправя погледна чичо си и го пробожда с малката си джбна чикийка." +
                "Леко ранен Гаргамел започва да отстъпва. Тога Артър успява да се докопа до меча си и без капка милост посича чичо си.Главата му падна .. търкулна се до съндъка където беше главата на баща му. Той размени главите и се оказа че сандъкът всъщност е бил друго измерение , в което баща му е бил заключен." +
                "След размяната на главите бащата на Артър е освободен.Заедно се завръщат в Царството и заживяват дълго и щастливо ");
            Console.ForegroundColor = ConsoleColor.Red;
            Console.WriteLine("Край!");
            Console.ForegroundColor = ConsoleColor.White;
            return "";
        }
        public string StealthPath()
        {
            Console.WriteLine("Младата дружина избира да минат незабелязано по край чудовищата.Успяват да се докопат до най високата кула на замъка къде се крие и Гаргамел.След като Артър го вижда от неописуем гняв хвърля копие по него,но за съжаление той успява да го избегне.Храбрите войни щурмуват в стаята. Гаргамел се изправя поглежда ги и им казва-Със вас е свършени. Той прави заклинание при което небето се разцепва и от него излиза голям дракон." +
                "Започва безмилостна битка при която някои от младите воини намират своя кай.Дракона бълва огън , но не след дълго бива повален. Гаргамел създава изроди и същества , които го пазят но и те биват повалени.Тогава Артър успява да се докопа до чичо си и с един замах му отсича главата.За да покаже своята храброст и да отмъсти за баща си взема главата за трофей," +
                "След като се връща обратно в Асгард си прави чаша от нея. И от тогава тъмната гора става територия на Асгард.Само че в нея се изпращат затворници , които срещат краят на дните си.");
            Console.ForegroundColor = ConsoleColor.Red;
            Console.WriteLine("Край!");
            Console.ForegroundColor = ConsoleColor.White;
            return "";
        }

        public string SecondChoice()
        {
            Console.WriteLine("Младият Артър не вярва на приказките на странника и ускърнен от думите му го изпраща на палачите за сигурна смърт , най церемонно те му отрязват главата на центъра на Асгард.");
            Console.ForegroundColor = ConsoleColor.Red;
            Console.WriteLine("Край!");
            Console.ForegroundColor = ConsoleColor.White;
            return "Ти избра Артър да не повярва";
        }  
    }  
}
